module ArabicHelper
  ARABIC_TO_LATIN = {
    "ا" => "a", "ب" => "b", "ت" => "t", "ث" => "th",
    "ج" => "j", "ح" => "h", "خ" => "kh", "د" => "d",
    "ذ" => "dh", "ر" => "r", "ز" => "z", "س" => "s",
    "ش" => "sh", "ص" => "s", "ض" => "d", "ط" => "t",
    "ظ" => "z", "ع" => "a", "غ" => "gh", "ف" => "f",
    "ق" => "q", "ك" => "k", "ل" => "l", "م" => "m",
    "ن" => "n", "ه" => "h", "و" => "w", "ي" => "y",
    "ء" => "'", "ئ" => "'", "ؤ" => "'", "ى" => "a",
    "ة" => "h", "ـ" => "", "ٓ" => "", "َ" => "", "ً" => "",
    "ُ" => "", "ٌ" => "", "ِ" => "", "ٍ" => "", "ْ" => "", "ّ" => ""
  }

  def transliterate_arabic(text)
    text.chars.map { |char| ARABIC_TO_LATIN[char] || char }.join
  end
end
